<a href="https://colab.research.google.com/github/mehdee4/hello-world/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#importing liberaries that we need

In [ ]:
import pandas as pandas
import numpy as numpy
from matplotlib import pyplot as pyplot

In [ ]:
#input dataframe

In [ ]:
people = {
         'first': ['Mehdi', 'Somi', 'Bita'],
         'last' : ['Afsharha', 'Ghelichkhani', 'Afs'],
         'email': ['mehdi@gmial.com', 'somi@gmail.com', 'bita@gmail.com']}

people = pandas.DataFrame(people, dtype = numpy.int8)
people.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   first   3 non-null      object
 1   last    3 non-null      object
 2   email   3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [ ]:
# import file

In [ ]:
address1= "/Users/mehdiafsharha/Desktop/Python Tutorial 1/countries.csv"
address2= '/Users/mehdiafsharha/Desktop/Python Tutorial 1/Data/survey/results.csv'
address3= '/Users/mehdiafsharha/Desktop/Python Tutorial 1/Data/survey/schema.csv'
address4= '/Users/mehdiafsharha/Desktop/Python Tutorial 1/Data/Test/Test1.csv'


#importing data from a csv. csv file must be in same folder as project folder
data3 = pandas.read_csv ('countries.csv')
survey = pandas.read_csv (address2)
#defining index when importing
surveySchema= pandas.read_csv (address3, index_col = 'Column')
test = pandas.read_csv (address4)

In [ ]:
#to export a dataframe as csv

In [ ]:
path1 =  "/Users/mehdiafsharha/Desktop/Python Tutorial 1/exported/countries_exported_test.csv"
data3.to_csv (path1)

In [ ]:
###########################################################################################
#pandas settings

In [ ]:
pandas.set_option('display.max_columns', 8)
pandas.set_option('display.max_rows', 8)

In [ ]:
#tail, head and showing column

In [ ]:
data3.head(3)
data3[['country', 'population']].head(2)

       country  population
0  Afghanistan     8425333
1  Afghanistan     9240934

In [ ]:
###########################################################################################
#checking type and shape of data

In [ ]:
survey.shape

(88883, 85)

In [ ]:
data3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
dtypes: int64(2), object(1)
memory usage: 40.1+ KB

In [ ]:
type (survey)

pandas.core.frame.DataFrame

In [ ]:
#Convert a data type to another type

In [ ]:
data3['year']=data3['year'].astype('object')
data3['year'] = data3['year'].astype('int64')

In [ ]:
#iloc and loc

In [ ]:
data3 ['country'].iloc[1000: 1002] #selecting country iten on row 1000
survey.loc[0: 1,  'Hobbyist' : 'Employment'] # loc
survey.loc[0: 1, ['MainBranch', 'Hobbyist']] # another loc

                               MainBranch Hobbyist
0  I am a student who is learning to code      Yes
1  I am a student who is learning to code       No

In [ ]:
###########################################################################################
#rows to update

In [ ]:
#change all inputs of a row
data3.loc[1] = ['Afgh', 1957, 1000, 2]
#change specific column
data3.loc[1, 'country'] = ['Afsha'] # or ...
data3.at[1,'country'] = 'Afghan'

data3.loc[1]

country       Afghan
year            1957
xxxulation      1000
newcolumn          2
Name: 1, dtype: object

In [ ]:
#changing values using filters
filt = people ['first'] == 'Bita'
people.loc[filt, 'last'] = 'Afsharha2'
people.head(3)

   first          last            email
0  Mehdi      Afsharha  mehdi@gmial.com
1   Somi  Ghelichkhani   somi@gmail.com
2   Bita     Afsharha2   bita@gmail.com

In [ ]:
#modifying row values by funcitons 1
#simple making upper case
people['email'] = people['email'].str.upper ()
people.head(3)

   first          last            email
0  Mehdi      Afsharha  MEHDI@GMIAL.COM
1   Somi  Ghelichkhani   SOMI@GMAIL.COM
2   Bita     Afsharha2   BITA@GMAIL.COM

In [ ]:
#modifying row values by functions 2. apply
#advanced apply function. apply is usef for a column or series.

#using a built-in function by apply
print(
    people['email'].apply(len)
 )

#using a new function by apply
def update_email(email):
    return 'personal' + email

people['email']= people['email'].apply(update_email)
print (people)

#using lambda
people['email'] = people['email']. apply(lambda x: x.lower())
print(people.head(3))

#using lambda on a dataframe
print(
    people.apply(lambda x: x.min())
)

0    71
1    70
2    70
Name: email, dtype: int64
   first          last                                              email
0  Mehdi      Afsharha  personalpersonalpersonalpersonalpersonalperson...
1   Somi  Ghelichkhani  personalpersonalpersonalpersonalpersonalperson...
2   Bita     Afsharha2  personalpersonalpersonalpersonalpersonalperson...
   first          last                                              email
0  Mehdi      Afsharha  personalpersonalpersonalpersonalpersonalperson...
1   Somi  Ghelichkhani  personalpersonalpersonalpersonalpersonalperson...
2   Bita     Afsharha2  personalpersonalpersonalpersonalpersonalperson...
first                                                 Bita
last                                              Afsharha
email    personalpersonalpersonalpersonalpersonalperson...
dtype: object

In [ ]:
#modifying row values by functions 3. applymap
#in the following two examples you see apply des not work on dataframe properly
#it works for column or series in dataframe (when using lambda)
print(
    people.apply(len)
)

print(people.apply(len, axis = 'columns')
     )

# for an entire dataframe we usually use applymap. it applys a function to all elements of a df
people.applymap(len)

first    3
last     3
email    3
dtype: int64
0    3
1    3
2    3
dtype: int64

   first  last  email
0      5     8     79
1      4    12     78
2      4     9     78

In [ ]:
#to replace a  value with another value

people['first'].replace({'Mehdi': 'Miti' , 'Bita': 'Bita Jooni'}, inplace = True)
people.head(3)

        first          last                                              email
0        Miti      Afsharha  personalpersonalpersonalpersonalpersonalperson...
1        Somi  Ghelichkhani  personalpersonalpersonalpersonalpersonalperson...
2  Bita Jooni     Afsharha2  personalpersonalpersonalpersonalpersonalperson...

In [ ]:
#map. map is like replace. but instead it put nan instead of not defined values
print(survey['Hobbyist'].head(3))
survey['Hobbyist'] = survey['Hobbyist'].map({'Yes' : True, 'No': False}).head(3)

0    Yes
1     No
2    Yes
Name: Hobbyist, dtype: object

0     True
1    False
2     True
Name: Hobbyist, dtype: bool

In [ ]:
###########################################################################################
#columns to update

In [ ]:
#columns to add
data3 ['newcolumn'] = 1
data3.head(1)

       country  year  population  newcolumn
0  Afghanistan  1952     8425333          1

In [ ]:
#columns to rename
data3.rename(columns={'year':'y', 'country':'c'}, inplace = False).head()
#you can use inplace function to replace the renamed value in dataframe

In [ ]:
##remove other columns or keep some certain columns
data3[['year', 'population']].head(1)

   year  population
0  1952     8425333

In [ ]:
#columns to remove
data3.drop ('newcolumn', axis = 'columns') # to remove one column
data3.drop (['year', 'population'] , axis ='columns') # to remove multiple columns option 1
data3.drop(columns = ['year', 'country']). head(1) # to remove multiple columns option 2

   population  newcolumn
0     8425333          1

In [ ]:
#columns upper or lower case
data3.columns = [x.upper() for x in data3.columns]

In [ ]:
#replace character in column names
data3.columns = data3.columns.str.replace('pop', 'xxx')
data3

          country  year  xxxulation  newcolumn
0     Afghanistan  1952     8425333          1
1          Afghan  1957        1000          2
2     Afghanistan  1962    10267083          1
3     Afghanistan  1967    11537966          1
...           ...   ...         ...        ...
1700     Zimbabwe  1992    10704340          1
1701     Zimbabwe  1997    11404948          1
1702     Zimbabwe  2002    11926563          1
1703     Zimbabwe  2007    12311143          1

[1704 rows x 4 columns]

In [ ]:
##########################################################################################
#filtering based on a value in a column

In [ ]:
#way one (not the best)
filterUs = (data3['country']=='United States')
us = data3[filterUs]
us.head(2)

In [ ]:
#way two. better solution
filterCountry = ((data3['country']=='China') | (data3['country']=='Afghanistan') ) & (data3['year']. isin([1952, 1957])) 

twoCountries = data3.loc [filterCountry , ['country','year']]
twoCountries.head()

In [ ]:
#filter contains a text
filtCountry = data3['country'].str.contains ('Af', na=False)
test = data3.loc [ filtCountry]
test.head()

In [ ]:
#excluding from filter

oppositeFilter = data3.loc [~filtCountry , ['country','year']]
oppositeFilter.head()

In [ ]:
###########################################################################################
#index

In [ ]:
people.index

In [ ]:
people

In [ ]:
people.reset_index(drop = True). head(2)

In [ ]:
#set index
people['fullName'] = people['first']+ ' ' + people['last']
people.set_index ('fullName').head()

In [ ]:
###########################################################################################
#Group by

In [ ]:
cc= data3.groupby (['country']).min() #min of everything
cc = data3.groupby (['country'], as_index = True) ['population'].max()
cc = pandas.DataFrame(cc)
cc.head()

In [ ]:
bb=survey.groupby (['Hobbyist']) ['Hobbyist'].count()
bb

In [ ]:
###########################################################################################
#Sort

In [ ]:
# Sort column
cc = cc.sort_values(['population'], ascending = False)
cc.head(3)

In [ ]:
#sort index
people.sort_index(inplace = True)
people

In [ ]:
###########################################################################################
#simple dataframe operations

In [ ]:
#math operations with a column
data3['population']+1
data3['population'].head(3)*2

In [ ]:
#drop a row with missing value in population. first row of data3 has missing value
data3.dropna(subset = ['population'], axis=0).head(3)
#if you put ,inpace=True inside the code, it will remove the row in original dataframe

In [ ]:
###########################################################################################
#to replace a missing value with some other value

In [ ]:
#Method 1. 
data3['population'].fillna(0).head(3)

In [ ]:
#method 2. you need to import numpy liberary first
data3['population'].replace(numpy.nan, 1).head(3)
#if you put ,inpace=Tru e inside the code, it will remove the row in original dataframe

In [ ]:
survey.index

In [ ]:
surveySchema